#ifndef Constant_h__
#define Constant_h__

const int WINCX = 1024;
const int WINCY = 720;

//타일 갯수
//Stage1----------------------------------------------------
const int STAGE1_TILECNTX = 27;
const int STAGE1_TILECNTY = 18;
//----------------------------------------------------------
//Stage2----------------------------------------------------
const int STAGE2_TILECNTX = 50;
const int STAGE2_TILECNTY = 24;
//----------------------------------------------------------
//Stage3----------------------------------------------------
const int STAGE3_TILECNTX = 26;
const int STAGE3_TILECNTY = 14;
//----------------------------------------------------------
//Boss Stage------------------------------------------------
const int BSTAGE_TILECNTX = 29;
const int BSTAGE_TILECNTY = 13;
//----------------------------------------------------------

//타일 크기
//Stage1----------------------------------------------------
const int STAGE1_TILESIZEX = 60;
const int STAGE1_TILESIZEY = 60;
//----------------------------------------------------------
//Stage2----------------------------------------------------
const int STAGE2_TILESIZEX = 62;
const int STAGE2_TILESIZEY = 62;
//----------------------------------------------------------
//Stage3----------------------------------------------------
const int STAGE3_TILESIZEX = 58;
const int STAGE3_TILESIZEY = 58;
//----------------------------------------------------------
//Boss Stage------------------------------------------------
const int BSTAGE_TILESIZEX = 63;
const int BSTAGE_TILESIZEY = 63;
//----------------------------------------------------------

//Map 크기
//Stage1----------------------------------------------------
const int STAGE1_MAPSIZEX = 1620;
const int STAGE1_MAPSIZEY = 1025;
//----------------------------------------------------------
//Stage2----------------------------------------------------
const int STAGE2_MAPSIZEX = 3056;
const int STAGE2_MAPSIZEY = 1462;
//----------------------------------------------------------
//Stage3----------------------------------------------------
const int STAGE3_MAPSIZEX = 1510;
const int STAGE3_MAPSIZEY = 768;
//----------------------------------------------------------
//Boss Stage------------------------------------------------
const int BSTAGE_MAPSIZEX = 1799;
const int BSTAGE_MAPSIZEY = 781;
//----------------------------------------------------------
#endif // DEBUG
